# Dotfiles Brewfile
# Install everything with: brew bundle --file=~/Developer/dotfiles/Brewfile

# Taps
tap "oven-sh/bun"

# ============================================================
# Command-line Tools
# ============================================================

# Modern Unix replacements
brew "atuin"            # Better shell history
brew "bat"              # Better cat
brew "dust"             # Better du
brew "eza"              # Better ls
brew "fd"               # Better find
brew "fzf"              # Fuzzy finder
brew "ripgrep"          # Better grep
brew "xh"               # Better curl
brew "zoxide"           # Better cd

# File managers & navigation
brew "tree"             # Directory tree viewer
brew "yazi"             # Terminal file manager
brew "walk"             # Terminal navigator

# Development tools
brew "ast-grep"         # Code search/lint/rewrite
brew "delta"            # Better git diffs
brew "gh"               # GitHub CLI
brew "git"              # Version control
brew "graphviz"         # Graph visualization
brew "hyperfine"        # CLI benchmarking
brew "jq"               # JSON processor
brew "lazygit"          # Git TUI

# Languages & runtimes
brew "go"               # Go language
brew "node"             # Node.js
brew "rust"             # Rust language
brew "zig"              # Zig language
brew "mise"             # Dev tool version manager
brew "bun"              # JavaScript runtime
brew "swiftformat"      # Swift formatter
brew "swig"             # Wrapper generator
brew "premake"          # Build configuration

# Terminal & shell
brew "tmux"             # Terminal multiplexer
brew "zellij"           # Terminal multiplexer
brew "starship"         # Shell prompt
brew "btop"             # System monitor

# Python tooling
brew "uv"               # Fast Python package installer

# Web & cloud
brew "caddy"            # Web server
brew "cloudflare-wrangler" # Cloudflare Workers CLI
brew "vercel-cli"       # Vercel deployment

# Media
brew "ffmpeg"           # Video/audio processing
brew "yt-dlp"           # YouTube downloader

# Utilities
brew "direnv"           # Per-directory env vars
brew "topgrade"         # Update everything

# ============================================================
# GUI Applications (Casks)
# ============================================================

# Productivity & Organization
cask "obsidian"         # Note-taking
cask "notion-calendar"  # Calendar
cask "raycast"          # Launcher
cask "anki"             # Flashcards

# Development
cask "cursor"           # AI Code editor
cask "visual-studio-code" # Code editor
cask "zed"              # Code editor
cask "ghostty"          # Terminal emulator
cask "orbstack"         # Docker alternative
cask "beekeeper-studio" # Database GUI
cask "insomnia"         # API client
cask "mitmproxy"        # HTTP debugging proxy
cask "ngrok"            # HTTP tunneling
cask "devtoys"          # Developer utilities

# System utilities
cask "karabiner-elements"  # Keyboard customization
cask "stats"               # Menu bar system monitor
cask "jordanbaird-ice@beta" # Menu bar manager
cask "tailscale-app"       # VPN mesh networking

# Media & Content
cask "iina"             # Media player
cask "obs"              # Screen recording
cask "spotify"          # Music
cask "calibre"          # E-book manager
cask "zotero"           # Reference manager

# Communication
cask "discord"          # Chat

# ============================================================
# Optional - Apps to consider
# ============================================================

cask "mac-mouse-fix"  # Better mouse

cask "cleanshot"      # Screenshots
cask "clop"           # Image optimizer (free)
cask "screen-studio"  # Screen recording
