# Dotfiles Brewfile
# Install everything with: brew bundle --file=~/Developer/dotfiles/Brewfile

# Taps
tap "oven-sh/bun"

# ============================================================
# Command-line Tools
# ============================================================

# Modern Unix replacements
brew "bat"              # Better cat
brew "eza"              # Better ls
brew "fzf"              # Fuzzy finder
brew "zoxide"           # Better cd

# Development tools
brew "gh"               # GitHub CLI
brew "git"              # Version control
brew "lazygit"          # Git TUI

# Languages & runtimes
brew "go"               # Go language
brew "node"             # Node.js
brew "rust"             # Rust language
brew "fnm"              # Fast Node Manager
brew "bun"              # JavaScript runtime

# Terminal & shell
brew "zellij"           # Terminal multiplexer
brew "starship"         # Shell prompt
brew "btop"             # System monitor

# Python tooling
brew "uv"               # Fast Python package installer

# Utilities
brew "topgrade"         # Update everything

# ============================================================
# GUI Applications (Casks)
# ============================================================

# Productivity & Organization
cask "obsidian"         # Note-taking
cask "notion-calendar"  # Calendar
cask "raycast"          # Launcher
cask "anki"             # Flashcards

# Development
cask "cursor"           # AI Code editor
cask "zed"              # Code editor
cask "ghostty"          # Terminal emulator
cask "orbstack"         # Docker alternative
cask "beekeeper-studio" # Database GUI
cask "insomnia"         # API client

# System utilities
cask "karabiner-elements"  # Keyboard customization
cask "stats"               # Menu bar system monitor
cask "jordanbaird-ice"     # Menu bar manager

# Media & Content
cask "obs"              # Screen recording
cask "spotify"          # Music
cask "calibre"          # E-book manager
cask "zotero"           # Reference manager

# Communication
cask "discord"          # Chat

# ============================================================
# Optional - Apps to consider
# ============================================================

cask "mac-mouse-fix"  # Better mouse

cask "cleanshot"      # Screenshots
cask "clop"           # Image optimizer (free)
cask "screen-studio"  # Screen recording
